<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Блог Любителя Компьютеров]]></title><description><![CDATA[Блог Любителя Компьютеров]]></description><link>http://localhost:2368/</link><image><url>http://localhost:2368/favicon.png</url><title>Блог Любителя Компьютеров</title><link>http://localhost:2368/</link></image><generator>Ghost 5.22</generator><lastBuildDate>Fri, 25 Nov 2022 18:38:51 GMT</lastBuildDate><atom:link href="http://localhost:2368/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Как я начал пользоваться Punto Switcher в 2022 году]]></title><description><![CDATA[<p>&#x421;&#x43E;&#x432;&#x441;&#x435;&#x43C; &#x43D;&#x435;&#x434;&#x430;&#x432;&#x43D;&#x43E; &#x43C;&#x43E;&#x439; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;&#x439; &#x443;&#x432;&#x438;&#x434;&#x435;&#x43B;, &#x43A;&#x430;&#x43A; &#x44F; &#x440;&#x430;&#x441;&#x442;&#x435;&#x440;&#x44F;&#x43D;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;</p>]]></description><link>http://localhost:2368/kak-ia-nachal-polzovatsia-punto-switcher-v-2022-ghodu/</link><guid isPermaLink="false">6380fe2ae5418f0dd050b31f</guid><category><![CDATA[IT суета]]></category><dc:creator><![CDATA[Кирилл Байтов]]></dc:creator><pubDate>Fri, 25 Nov 2022 18:22:07 GMT</pubDate><media:content url="http://localhost:2368/content/images/2022/11/1324624738_punto_switcher_for_mac-2562963952-1.jpg" medium="image"/><content:encoded><![CDATA[<img src="http://localhost:2368/content/images/2022/11/1324624738_punto_switcher_for_mac-2562963952-1.jpg" alt="&#x41A;&#x430;&#x43A; &#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; Punto Switcher &#x432; 2022 &#x433;&#x43E;&#x434;&#x443;"><p>&#x421;&#x43E;&#x432;&#x441;&#x435;&#x43C; &#x43D;&#x435;&#x434;&#x430;&#x432;&#x43D;&#x43E; &#x43C;&#x43E;&#x439; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;&#x439; &#x443;&#x432;&#x438;&#x434;&#x435;&#x43B;, &#x43A;&#x430;&#x43A; &#x44F; &#x440;&#x430;&#x441;&#x442;&#x435;&#x440;&#x44F;&#x43D;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x441;&#x44C; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x440;&#x430;&#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#xAB;&#x410; &#x442;&#x44B; punto switcher &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x448;&#x44C;&#x441;&#x44F;?&#xBB; &#x2014; &#x43F;&#x440;&#x43E;&#x437;&#x432;&#x443;&#x447;&#x430;&#x43B;&#x43E; &#x441; &#x435;&#x433;&#x43E; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B;. &#x414;&#x43E;&#x43B;&#x433;&#x43E; &#x43D;&#x435; &#x440;&#x430;&#x437;&#x434;&#x443;&#x43C;&#x44B;&#x432;&#x430;&#x44F;, &#x44F; &#x432;&#x43F;&#x438;&#x441;&#x430;&#x43B; &#x432; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x43E;&#x432;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443; &#x42F;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430; &#xAB;&#x43F;&#x43E;&#x43D;&#x442;&#x43E; &#x441;&#x432;&#x438;&#x442;&#x447;&#x435;&#x440;&#xBB;, &#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x435;&#x449;&#x451; &#x440;&#x430;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x43B;. &#x417;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;&#x439; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x430;&#x43B; &#x438;&#x434;&#x435;&#x44E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B; &#x438; &#x443;&#x448;&#x451;&#x43B;.</p><p><strong>Punto Switcher</strong> &#x2014; &#x43E;&#x434;&#x43D;&#x43E; &#x438;&#x437; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x42F;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;.<br>&#x418;&#x434;&#x435;&#x44F;<em> </em>&#x2014; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x438;&#x435;/&#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43E;&#x43A; Eng/Rus, &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x441; &#x441;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x438; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430;.</p><!--kg-card-begin: markdown--><p>&#x427;&#x442;&#x43E; &#x44F; &#x43F;&#x43E;&#x43D;&#x44F;&#x43B; &#x437;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;:</p>
<ul>
<li>&#x41D;&#x430;&#x431;&#x43E;&#x440; &#xAB;&#x43A;&#x443;&#x44B;&#xBB;, &#xAB;&#x440;&#x443;&#x434;&#x434;&#xBB;, &#xAB;&#x437;&#x449;&#x448;&#xBB; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x451;&#x442; &#x43A; &#x441;&#x43C;&#x435;&#x43D;&#x435; &#x440;&#x430;&#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x438; &#x438; &#xAB;res&#xBB;, &#xAB;hell&#xBB;, &#xAB;poi&#xBB;.</li>
<li>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x435;&#x431;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x433;&#x440;&#x43E;&#x43C;&#x43A;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x442;&#x438;&#x43F;&#x430; &#xAB;&#x43E;&#x433;&#x43E; &#x433;&#x43E; &#x451; &#x43C;&#x430;&#x451; &#x43D;&#x430;&#x444;&#x438;&#x433; &#x431;&#x43B;&#x438;&#x43D; &#x434;&#x430;&#x440;&#x43E;&#x432;&#x430; &#x43C;&#x443;&#x436;&#x438;&#x43A;&#x438;&#x1F43A;, @here &#x43A;&#x442;&#x43E; &#x432; &#x434;&#x43E;&#x442;&#x443;?&#xBB;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x441;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#xAB;&#x433;&#x43E; &#x434;&#x43E;&#x442;&#x430;&#xBB;.</li>
<li>&#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43A; &#x438;&#x43B;&#x438; &#x422;&#x410;&#x41A;, &#x43D;&#x430;&#x436;&#x430;&#x432; &#x43D;&#x430; alt + break.</li>
<li>&#x418;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x442;&#x430;&#x43B;&#x43E; &#x435;&#x449;&#x451; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x2014; &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x448;&#x44C; &#x442;&#x435;&#x43A;&#x441;&#x442; + &#x441;&#x43E;&#x447;&#x435;&#x442;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448; = &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x439; &#x42F;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x441; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x430;&#x43C;&#x438; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;.</li>
</ul>
<!--kg-card-end: markdown--><p>&#x41A;&#x430;&#x43A; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x434;&#x430;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;&#x435; &#x43D;&#x435; &#x430;&#x439;&#x442;&#x438;&#x448;&#x43D;&#x438;&#x43A;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43F;&#x43E;&#x441;&#x43E;&#x432;&#x435;&#x442;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E;&#x435;.</p><!--kg-card-begin: html--><!DOCTYPE html>
<html>
<head>
<style>
.button {
  background-color: #1b9d1e;
  border: none;
  color: white;
  text-align: center;
  text-decoration: none;
  display: inline-block;
  font-size: 16px;
  margin: 40px 2px;
  cursor: pointer;
}
</style>
</head>
<body>

<button class="button" onclick="window.location.href=&apos;https://yandex.ru/soft&apos;;">Punto Switcher</button>

</body>
</html>


<!--kg-card-end: html-->]]></content:encoded></item></channel></rss>